[
    {
        
        "title": "Data Fusion for Visual Navigation: Robust Robot Trajectory from Stereo-VIO-GPS",
        "authors": "Wissem Dilmi, Sami El Ferik, Fethi Ouerdane, Mustapha K. Khaldi, Abdul-Wahid A. Saif",
        "abstract": "This study addresses deploying deep learning-based object detection on UAVs and ground robots for real-time logistics applications, including a comparative analysis of YOLOv5 and YOLOv8.",
        "link": "https://www.mdpi.com/1424-8220/25/8/2572",
        "image": "data/images/poster_stereo.png"
    },
    {
       
        "title": "Technical Aspects of Deploying UAV and Ground Robots for Intelligent Logistics Using YOLO on Embedded Systems",
        "authors": "Wissem Dilmi, Sami El Ferik, Fethi Ouerdane, Mustapha K. Khaldi, Abdul-Wahid A. Saif",
        "abstract": "Automation of logistics enhances efficiency, reduces costs, and minimizes human error. Image processing—particularly vision-based AI—enables real-time tracking, object recognition, and intelligent decision-making, thereby improving supply chain resilience. This study addresses the challenge of deploying deep learning-based object detection on resource-constrained embedded platforms, such as NVIDIA Jetson devices on UAVs and ground robots, for real-time logistics applications. Specifically, we provide a comprehensive comparative analysis of YOLOv5 and YOLOv8, evaluating their performance in terms of inference speed, accuracy, and dataset-specific metrics using both the Common Objects in Context (COCO) dataset and a novel, custom logistics dataset tailored for aerial and ground-based logistics scenarios. A key contribution is the development of a user-friendly graphical user interface (GUI) for selective object visualization, enabling dynamic interaction and real-time filtering of detection results—significantly enhancing practical usability. Furthermore, we investigate and compare deployment strategies in both Python 3.9 and C# (ML. NET v3 and .NET Framework 7) environments, highlighting their respective impacts on performance and scalability. This research offers valuable insights and practical guidelines for optimizing real-time object detection deployment on embedded platforms in UAV- and ground robot-based logistics, with a focus on efficient resource utilization and enhanced operational effectiveness.",
        "link": "https://www.mdpi.com/1424-8220/25/8/2572",
        "image": "data/images/sensors_tech_dilmi.png"
    },
    {
       
        "title": "Variations in EEG Signals Across Different Brain Regions during Motor Imagery and Execution Tasks",
        "authors": "Maged S. Al-Quraishi, Syed Saad Azhar Ali, Haitham H. Saleh, Mahmoud S. Abouomar",
        "abstract": "Electroencephalography techniques used in Brain computer interface to control external devices. Different BCI applications based on EEG were reported such as controlling the robotic arm, computer courser or gaming. Motor execution and motor imagery are both used as EEG input control signals to control the peripheral devices. However, some applications are required to control the peripheral devices using thoughts (motor imagery) only. In this case, differentiation between actual and imagery action is crucial. In this work, the investigation of the changes of the power spectrum of the EEG bands including alpha and beta bands in the different brain regions. The public dataset recorded from 60 subjects in different movements task were used. Th Alpha (8-12 Hz) and Beta (13-30 Hz) were extracted from the recorded EEG signals. After the preprocessing, the power spectrum was calculated for each band in four brain regions including central sulcus, motor cortex, sensorimotor cortex. The results reveal that significant differences were found in the area in the alpha and beta bands in the motor cortex and sensorimotor cortex. while in the central sulcus the differences were insignificant. The results of this study are still preliminary and more investigation using different EEG quantities and features are required. Additionally, this study needs to be validated with another dataset. © 2024 The Authors. Published by ELSEVIER B.V.",
        "link": "https://www.scopus.com/inward/record.uri?eid=2-s2.0-105001492739&doi=10.1016%2fj.trpro.2025.03.099&partnerID=40&md5=69d397e830b539416651ab4145e2cfbf",
        "image": "data/images/eeg_motor_imagery.png"
    },
    {
       
        "title": "VISUAL SERVOING TECHNIQUES FOR SPECULAR REFLECTION MITIGATION IN UAV-BASED METER INSPECTION",
        "authors": "Alice Johnson, Bob Smith, Carol White",
        "abstract": "This paper explores how AI-driven real-time object detection can improve logistics efficiency and automation across various industries, focusing on practical deployment on embedded systems.",
        "link": "https://www.example.com/paper2",
        "image": "data/images/poster_reflection.png"
    },
    {
       
        "title": "Stereo Visual Matching for UAV Navigation: Multi-Channel Disparity Map-Based Trajectory Estimation",
        "authors": "Wissem Dilmi, Sami El-Ferik, Abdul-Wahid A. Saif",
        "abstract": "Stereo vision and matching constitute a deeply researched sector within computer vision, particularly in the domains of robot and drone navigation, augmented reality, and automotive applications. Stereo matching performs more effectively in scenarios without radiometric variations compared to those with such variations present. This study delves into stereo matching techniques and proposes novel frameworks aimed at enhancing precise localization and velocity measurement of UAVs within defined boundaries. The primary focus lies on refining the accuracy of the resulting disparagement map, achieved through three key phases: pre-processing, stereo matching, and post-processing. Initially, input images undergo pre-processing using NMHE to mitigate radiometric variations. Subsequently, various features are extracted from both images during the second phase. Finally, the disparagement map undergoes post-processing to eliminate minor artifacts. Experimental findings demonstrate that the proposed modifications have significantly enhanced the performance of state-of-the-art local stereo matching algorithms and bolstered their resilience against radiometric changes.",
        "link": "https://doi.org/10.1109/SSD64182.2025.10989917",
        "image": "data/images/uav_stereo_matching.png"
    },
    
     {
       
        "title": "Cargo-Drone",
        "authors": "IRC For Smart Mobility and Logistics",
        "abstract": "High endurance 10-12 h, Speed 150 km/h, Hybrid VTOL, KFUPM Research & Innovation Forum 2024",
        "link": "https://www.youtube.com/watch?v=dKB3cy1Lk0Q&ab_channel=KFUPM",
        "image": "data/images/cargo_drone_01.png"
    },
     {
       
        "title": "WIDE RANGE HIGH GAIN CONVERTER FOR H2 BASED VEHICLE",
        "authors": "WDr. Ali. T. Al-Awami and Dr. Md Samiullah",
        "abstract": "This poster presents a wide-range high-gain DC-DC converter designed for hydrogen-based vehicles. The proposed converter overcomes the limitations of conventional boost converters, which face significant challenges at high voltage levels, such as high duty ratios, excessive component stress, and increased switching losses. By incorporating extended design elements and double duty cycles, this converter achieves high voltage gain with reduced stress on components, continuous input current, and a flexible operating range. The converter's performance is validated through experiments on a 600W prototype, demonstrating its effectiveness for high-voltage applications.",
        "link": "https://www.youtube.com/watch?v=dKB3cy1Lk0Q&ab_channel=KFUPM",
        "image": "data/images/h2_based_vehicle_02.png"
    },
    {
    "title": "Dual-use Autonomous Marine System",
    "authors": "IRC For Smart Mobility and Logistics",
    "abstract": "Hydrogen powered, Endurance 2-3h, Surface and Gator modes, KFUPM Research & Innovation Forum 2024",
    "link": "https://www.youtube.com/watch?v=dKB3cy1Lk0Q&ab_channel=KFUPM",
    "image": "data/images/dual_use_marine_03.png"
}
,{
    "title": "High Value Air Logistics",
    "authors": "IRC For Smart Mobility and Logistics",
    "abstract": "Endurance 1h-10h, Short Takeoff and Landing , Speed 100km/h to 450 km/h, KFUPM Research & Innovation Forum 2024",
    "link": "https://www.youtube.com/watch?v=dKB3cy1Lk0Q&ab_channel=KFUPM",
    "image": "data/images/air_logisitcs_04.png"
}
,{
    "title": "UAV-Manipulator Systems: Modelling and Control Design",
    "authors": "Dr. Eltayeb, Eng. Karim Sattar, Dr. Nezar Al Yazidi, Dr. Mahmoud Samy",
    "abstract": "UAV-Manipulator system, in which a robotic arm with N-DOFs (N=1, 2, 3, … n) is attached to the unmanned aerial vehicle UAV system with 6-DOFs. Recently, UAV systems are getting remarkable attention from researchers due to their daily involvement in many applications including both sectors: military and civilian. The UAV-Manipulator flying system will add more significant features which result in expanding the applications to include package handling, infrastructure inspection, assembling, maintenance, repair, contingency operations, irrigation monitoring, palm pollination, and delivering medical logistics. UAV-Manipulator flying system is classified as multibody dynamics systems, with high nonlinearity, and coupled dynamics. The scope of this research project will cover the theoretical background, simulation tests, and experimental validation for the flying robotic arm system.",
    "link": "https://www.youtube.com/watch?v=dKB3cy1Lk0Q&ab_channel=KFUPM",
     "image": "data/images/uav_manipulator_05.png"
},{
    "title": "Sustainable Campus Mobility: Evaluating and Enhancing Walkability Through Virtual Reality",
    "authors": "Dr. M. Aamir Basheer",
    "abstract": "Campus walkability plays a critical role in promoting physical activity and improving the quality of life. This research explores the use of virtual reality (VR) as a tool to evaluate and improve walking experience. Using a wearable VR headset, participants navigated various urban design scenarios, providing real-time feedback on their walking experience. The study aims to promote sustainability and encourage physical activity by identifying key design interventions that align with user preferences and needs.",
    "link": "https://www.youtube.com/watch?v=dKB3cy1Lk0Q&ab_channel=KFUPM",
     "image": "data/images/vr_walkability.png"
}
,{
    "title": "A Joint Planning Model for Distributed Energy",
    "authors": "Adnan Al-Bukhaytan, Ali T. Al-Awami",
    "abstract": "This work presents a planning model for a distribution system to meet a growing electrical demand that includes water desalination plants (WDP). The objective is to find the optimal sizes and locations for distributed energy resources (DERs) to supply the expected demands while optimizing the long-term profits for the distribution system operator (DSO). The DERs include photovoltaics (PV), wind turbines (WT), thermal generators (TG), and battery energy storage systems (BESS). The proposed model considers the coordination with the water desalination plant operator (WDPO) in the operational aspect to provide energy flexibility to the DSO.",
    "link": "https://www.youtube.com/watch?v=dKB3cy1Lk0Q&ab_channel=KFUPM",
     "image": "data/images/joint_dist_desalination_06.png"
}
,{
    "title": "Balancing Capacity and Capability: A Novel Network Approach for Efficient Warranty Repair Coverage",
    "authors": "AUTHORS_PLACEHOLDER",
    "abstract": "This study develops a multi-objective reverse logistics network for managing multi-type warranty returns in closed-loop supply chains using a mixed-integer linear programming model. The model minimizes costs (facility, transport, refurbishment, environmental) and optimizes cycle times and demand fulfilment. A mobile phone case study using the GLPK solver shows improved efficiency, reduced CO2 emissions, and adaptability to demand changes through sensitivity analysis.",
    "link": "https://ri.kfupm.edu.sa/irc-sml/research/projects/project-details/balancing-capacity-and-capability-a-novel-network-approach-for-efficient-warranty-repair-coverage",
     "image": "data/images/warranty_repair_coverage_07.png"
}
,{
    "title": "Sensors Technologies for Driver State Detection",
    "authors": "AUTHORS_PLACEHOLDER",
    "abstract": "Several studies reveal that 75% of road accidents are related to the drivers behavior. Fatigue and drowsiness are the two main factors influencing the drivers behavior. To alleviate these fatal accidents, the drivers state should be monitored",
    "link": "LINK_PLACEHOLDER",
     "image": "data/images/driver_state_detection_08.png"
}
,{
    "title": "Robust ISMC control of PEM Fuel cell voltage for h2 vehicle",
    "authors": "Dr. Ali. T. Al-Awami",
    "abstract": "Maintaining precise output voltage is critical for optimal performance in Proton Exchange Membrane (PEM) fuel cell systems, a cornerstone technology in hydrogen-based vehicles. This research introduces a robust adaptive fixed-time integral sliding mode control (FxT ISMC) strategy to address voltage regulation challenges caused by uncertainties in load and input voltage. FxT ISMC eliminates the need for pre-defined disturbance bounds through adaptive gains and therefore simplifies the implementation. The ISMC design guarantees robust and rapid convergence to the desired voltage, regardless of initial conditions, ensuring smooth power delivery for the electric motor in a hydrogen vehicle. The benefits include faster voltage regulation, lower voltage spikes, reduced control oscillations, and exceptional resilience to fluctuations, ultimately contributing to a more efficient and reliable method of propulsion in hydrogen-powered vehicles.",
    "link": "https://ri.kfupm.edu.sa/irc-sml/research/projects/project-details/robust-ismc-control-of-pem-fuel-cell-voltage-for-h2-vehicle",
     "image": "data/images/ismc_control_09.png"
}
,{
    "title": "Brain Assess Intelligent Neuro-Diagnostic System Enhancing Brain MRI Processing for Efficient Healthcare Management in Smart Cities",
    "authors": "Dr. Syed Saad Azhar Ali",
    "abstract": "ABSTRACT_PLACEHOLDER",
    "link": "LINK_PLACEHOLDER",
     "image": "data/images/intelligent_neuro_diag_10.png"
}
,{
    "title": "Brain powered Autonomy in Logistics Operations",
    "authors": "Dr. Maged S. AL-Quraishi, Dr. Syed S. Azhar, and Dr. Sami El-Ferik",
    "abstract": "ABSTRACT_PLACEHOLDER",
    "link": "LINK_PLACEHOLDER",
     "image": "data/images/brain_powered_autonomy_11.png"
}
,{
    "title": "Robust Dynamic Event-Triggered Formation Control of Multiagent System",
    "authors": "PI: Dr. A. Saif, CoI: Dr. S. El ferik",
    "abstract": "This project presents a novel dynamic event-triggered formation control scheme for multiagent systems, with a specific focus on UAVs. Unlike traditional methods, which rely on pre-determined reference trajectories, we introduce an adaptive approach where the leader agent generates a real-time flexible reference trajectory by incorporating an unknown input signal. This allows the leader to dynamically adjust its trajectory in response to environmental changes, obstacles, or mission variations. The proposed robust control framework employs event-triggered mechanisms that optimize communication bandwidth, significantly reducing the need for continuous information exchange between agents.",
    "link": "https://ri.kfupm.edu.sa/irc-sml/research/projects/project-details/robust-dynamic-event-triggered-formation-control-of-multiagent-system",
     "image": "data/images/robust_dynamic_event_12.png"
}
,{
    "title": "Real-Time Battery State Estimation and Frequency Control",
    "authors": "PI: Dr. Nezar Al Yazidi",
    "abstract": "This project focuses on the development of a real-time battery state estimation and voltage/frequency control system. The proposed approach integrates advanced battery management algorithms with voltage/frequency control mechanisms to enhance the reliability and efficiency of power systems. Through a combination of state-of-the-art estimation techniques and control strategies, the system aims to provide accurate state-of-charge (SOC) predictions and maintain stable frequency levels. Initial results demonstrate the effectiveness of the proposed method in both simulated and real-world scenarios, showing significant improvements in battery utilization and frequency regulation.",
    "link": "https://ri.kfupm.edu.sa/irc-sml/research/projects/project-details/real-time-battery-state-estimation-and-frequency-control",
     "image": "data/images/battery_state_estimation_13.png"
}
,{
    "title": "Data-driven models for logistics optimization",
    "authors": "PI: Dr. Awsan Mohammed, CoI: Dr. A. Al-Hanbali,",
    "abstract": "The delivery time of goods in the supply chain is a critical enabler for achieving overall supply chain excellence and business success. However, the uncertainty of the delivery times of goods is a significant issue, making it critical for businesses to develop effective logistics and shipping strategies. Accurately forecasting delivery times is needed to maintain smooth logistics operations and, ultimately, reduce overall transportation, shortage, and inventory costs. Consequently, the purpose of this paper is to propose machine learning algorithms for predicting the delivery time and enhancing the responsiveness of the supply chain in the oil and gas industry.  The proposed models will help in building a resilient supply chain capable of adapting to unforeseen events and disruptions. In this paper, the factors influencing the delivery time of the goods in the oil and gas supply chain are identified based on reviewing the literature and expert interviews. Different statistical analysis tests are conducted to ensure the quality of data. In addition, the correlation between the input factors and between input and output is investigated. The machine learning models are developed and validated using real data from an important field; the gas and oil industry.  The results indicated that the factors that influence the delivery time of the goods in oil and gas include annual order hits, priority, supplier region, product complexity, and transportation method. Moreover, the findings revealed the capability of the proposed models to predict the delivery time with an accuracy higher than 85%. This study provides managers with valuable tools for managing and optimizing their supply chain operations by highlighting the critical factors influencing delivery time and providing a reliable predictive model. In addition, the proposed models are expected to assess the organization in reducing supply chain transportation, inventory, and shortage costs. ",
    "link": "https://ri.kfupm.edu.sa/irc-sml/research/projects/project-details/data-driven-models-for-logistics-optimization",
     "image": "data/images/data_logisitics_optimize_14.png"
},{
    "title": "Exploring the interaction between micromobility vehicles and pedestrians on shared pathways",
    "authors": "PI: Dr. Muhammad Abdullah",
    "abstract": "This study investigates the interactions between micromobility vehicles and pedestrians sharing pathways, focusing on several factors including pathway, vehicle and user characteristics. Field and VR experiments will be conducted to assess these factors using statistical and machine learning methods. The findings aim to provide insights into how these variables influence pedestrian-micromobility interactions.",
    "link": "https://ri.kfupm.edu.sa/irc-sml/research/projects/project-details/exploring-the-interaction-between-micromobility-vehicles-and-pedestrians-on-shared-pathways",
     "image": "data/images/interaction_mobility_15.png"
},{
    "title": "Optimizing Electric Vehicle Charging Infrastructure for Distribution Systems through Energy Management and User Behavior",
    "authors": "PI: Dr. Salman Habib",
    "abstract": "The rapid adoption of electric vehicles (EVs) presents both opportunities and challenges for distribution networks. This study explores strategies for effectively integrating EVs, focusing on grid stability, load management, and renewable energy synergy. Key factors like demand response, smart charging, and infrastructure upgrades are analyzed to ensure optimal power flow and reduced grid strain.",
    "link": "https://ri.kfupm.edu.sa/irc-sml/research/projects/project-details/optimizing-electric-vehicle-charging-infrastructure-for-distribution-systems-through-energy-management-and-user-behavior",
     "image": "data/images/opt_electric_vehicle_charging_16.png"
},{
    "title": "Optimization of Drone-Locker Delivery System",
    "authors": "PI: Dr. Ahmed Ghaithan, CoI: Dr. Awsan Mohammed",
    "abstract": "The growth of e-commerce and the rising of customer expectations mandates efficient design and planning of last-mile logistics. This study presents a novel delivery network design for a locker-drone system that optimizes the integration of trucks and drones to improve delivery efficiency and reduce costs. A mixed-integer linear programming (MILP) model is developed to optimize the delivery network and determine the locations for lockers, number of trucks, number of drones at each locker, and maintenance schedule. The model considers factors like drone range, locker and truck capacities, and maintenance. The study results will significantly impact the logistics and supply chain sector by streamlining the last-mile delivery process, especially in community and intra-facility contexts. It will offer a more cost-effective alternative to traditional delivery methods, thus benefiting both service providers and end-users.",
    "link": "https://ri.kfupm.edu.sa/irc-sml/research/projects/project-details/optimization-of-drone-locker-delivery-system",
     "image": "data/images/drone_locker_delivery_17.png"
},{
    "title": "Harnessing Graph Theory and Machine Learning for Hydrogen Mobility Solutions",
    "authors": "PI: Dr. Monther Alfuraidan",
    "abstract": "In this research, we propose the use of graph theory and machine learning to gain insights into factors critical to hydrogen production and storage, aiming to develop a predictive model that can analyze and optimize the structural properties of materials used for hydrogen synthesis and storage. The graph representations of chemical structures, combined with their properties, will serve as the foundation to extract essential features. These features will then be provided to machine learning algorithms to predict factors contributing to optimal interactions.",
    "link": "https://ri.kfupm.edu.sa/irc-sml/research/projects/project-details/harnessing-graph-theory-and-machine-learning-for-hydrogen-mobility-solutions",
     "image": "data/images/harness_graph_theory.png"
},{
    "title": "Hydrogen Powered Autonomous Marine Systems for a Sustainable Future",
    "authors": "PI: Dr Sami El Ferik",
    "abstract": "Hydrogen fuel cells are a game-changing technology for the development of autonomous marine systems. Offering high energy density, extended operational periods, and zero-emission performance, they present a viable solution for sustainable maritime innovation. This poster investigates the potential of hydrogen-powered autonomous systems and their applications in areas such as wildlife monitoring, tourism, and the oil and gas sector.",
    "link": "https://ri.kfupm.edu.sa/irc-sml/research/projects/project-details/hydrogen-powered-autonomous-marine-systems-for-a-sustainable-future",
     "image": "data/images/hydro_marine_18.png"
}
,{
    "title": "Optimal Configuration of a Stand-alone Photovoltaic System by Maximizing Energy Density Considering Hydrogen-Based Storage Solutions",
    "authors": "PI: Dr. Ahmed Atiah, CoI: Dr. Mohamed Darahouth",
    "abstract": "Choosing the optimal configuration and capacity planning for a hybrid PV-hydrogen system is a strategic decision-making process that spans approximately 20 years, during which climate and economic factors play a significant role. For this purpose, this research proposes a multi-objective mixed-integer nonlinear programming (MO-MINLP) optimization model that considers economic, technical, and environmental objectives. Additionally, this research utilizes the concept of conditional value at risk (CVaR) in risk management to optimize the energy density over time. The hybrid system includes decision variables such as tilt angle, spacing between PV panels, number of PV panels, number of hydrogen tanks, number of electrolyzers, number of fuel cells, and quantity of hydrogen stored over time. MO optimization helps study the trade-offs among economic, technical, and environmental objectives. We will provide a real-world case to demonstrate the practicability of the optimization model, which involves a PV-hydrogen system to supply power to the residential area at KFUPM.",
    "link": "https://ri.kfupm.edu.sa/irc-sml/research/projects/project-details/optimal-configuration-of-a-stand-alone-photovoltaic-system-by-maximizing-energy-density-considering-hydrogen-based-storage-solutions",
     "image": "data/images/pv_hydro_based_storage_19.png"
}
,{
    "title": "Mixed Traffic of Autonomous and Human-Driven Vehicles on Highways",
    "authors": "PI: Dr. M. F. Mysorewala",
    "abstract": "A multi-level decision-making and control framework is proposed for mixed traffic of autonomous and human-driven vehicles on smart city highways, contributing to sustainable cities and communities by improving road safety, optimizing efficiency and vehicle performance in urban transportation systems.",
    "link": "https://ri.kfupm.edu.sa/irc-sml/research/projects/project-details/mixed-traffic-of-autonomous-and-human-driven-vehicles-on-highways",
     "image": "data/images/mixed_traffic_human_20.png"
},{
    "title": "Information-Geometry-Based Bayesian Parameter Estimations for High-Dimensional Dynamical Systems",
    "authors": "PI: Dr. Muhammad Fuady Emzir",
    "abstract": "This project applies information geometry, which models probability distributions as Riemannian manifolds, to develop efficient continuous-discrete projection filters for parameter estimation in stochastic dynamical systems governed by stochastic differential equations (SDEs) with discrete-time measurements. By employing Bayesian methods such as Markov chain Monte Carlo (MCMC) sampling and variational inference, the approach aims to be more scalable, accurate, and computationally efficient than existing methods. This work seeks to enhance the understanding and interpretation of dynamical systems across fields like engineering, science, and economics.",
    "link": "https://ri.kfupm.edu.sa/irc-sml/research/projects/project-details/information-geometry-based-bayesian-parameter-estimations-for-high-dimensional-dynamical-systems",
     "image": "data/images/information_geometry_21.png"
}
,{
    "title": "Innovative Machine Learning Approaches for Human Gait Mobility Analysis",
    "authors": "Dr. Syed S. Azhar",
    "abstract": "The objective of this project is to develop a multimodal machine learning algorithm capable of accurately identifying human gait patterns, with a particular focus on distinguishing between normal and abnormal gait for clinical applications. The algorithm will be designed to generalize effectively across individuals, accounting for the natural variability in gait among different people. To ensure real-world applicability, the model will be validated using real-world gait data.",
    "link": "LINK_PLACEHOLDER",
     "image": "data/images/gait_mobility_analysis.png"
},{
    "title": "Lightweight and Computationally Efficient YOLO for Rogue UAV Detection in Complex Backgrounds",
    "authors": "PI: Dr. Zeeshan Kaleem",
    "abstract": "The growing popularity of Unmanned Air Vehicles (UAVs) for services like traffic monitoring, emergency communication, and deliveries has raised security and privacy concerns due to unauthorized drone use. To address the need for fast, efficient, and precise UAV detection under various conditions, a Lightweight and Computationally Efficient You Only Look Once (LCE-YOLO) architecture is proposed. LCE-YOLO, an enhanced version of YOLOv5s to focus on small and overlooked features critical for robust UAV detection. It is classified to have three variants, each optimized for specific feature maps, reducing computational costs while maintaining accuracy. LCE-YOLO, particularly LCE-YOLO-M, demonstrates significant performance improvements, achieving a precision of 96.8%, recall of 89.2%, mAP of 95.9%, and IoU of 50.2% in UAV detection, outperforming state-of-the-art in addressing computational complexity issues.",
    "link": "https://ri.kfupm.edu.sa/irc-sml/research/projects/project-details/lightweight-and-computationally-efficient-yolo-for-rogue-uav-detection-in-complex-backgrounds",
     "image": "data/images/yolo_rogue_uav_detection_22.png"
}
]
